# name = input("Введите ваше имя: ")
# print("Привет,", name)

isMarried = False
print(isMarried)

isAlive = True
print(isAlive)

# Перевод чисел из двоичной системы в десятичную
a = 0b11
b = 0b1011
c = 0b100001
print(a) # 3 в десятичной системе
print(b) # 11 в десятичной системе
print(c) # 33 в десятичной системе

# Перевод чисел из восьмеричной системы в десятичную
a = 0o7
b = 0o11
c = 0o17
print(a) # 7 в десятичной системе
print(b) # 9 в десятичной системе
print(c) # 15 в десятичной системе

# Перевод чисел из восьмеричной системы в десятичную
a = 0x0A
b = 0xFF
c = 0xA1
print(a) # 10 в десятичной системе
print(b) # 255 в десятичной системе
print(c) # 161 в десятичной системе
