# ###################################################################################
# ###################################################################################
#
# # Запрос информации у пользователя
# name = input("Введите ваше имя: ")
# print("Привет,", name)
#
# ###################################################################################
# ###################################################################################
#
# isMarried = False
# print(isMarried)
#
# isAlive = True
# print(isAlive)
#
# ###################################################################################
# ###################################################################################
#
# # Перевод чисел из двоичной системы в десятичную
# a = 0b11
# b = 0b1011
# c = 0b100001
# print(a)  # 3 в десятичной системе
# print(b)  # 11 в десятичной системе
# print(c)  # 33 в десятичной системе
#
# # Перевод чисел из восьмеричной системы в десятичную
# a = 0o7
# b = 0o11
# c = 0o17
# print(a)  # 7 в десятичной системе
# print(b)  # 9 в десятичной системе
# print(c)  # 15 в десятичной системе
#
# # Перевод чисел из шестнадцатеричной системы в десятичную
# a = 0x0A
# b = 0xFF
# c = 0xA1
# print(a)  # 10 в десятичной системе
# print(b)  # 255 в десятичной системе
# print(c)  # 161 в десятичной системе
#
# ###################################################################################
# ###################################################################################
#
# # Разделение текста на части
# # 1 способ:
# text = ("Я помню чудное мгновенье: "
#         "Передо мной явилась ты")
# print(text)
# print()
#
# # 2 способ (можно использовать одинарные или двойные кавычки):
# text = '''Я помню чудное мгновенье:
# Передо мной явилась ты,
# Как мимолетное виденье,
# Как гений чистой красоты.\n
# В томленьях грусти безнадежной,
# В тревогах шумной суеты,
# Звучал мне долго голос нежный
# И снились милые черты.'''
# print(text)
#
# ###################################################################################
# ###################################################################################
#
# # Применение специальных символов:
# text = "Message: \n\"Hello, World!\""
# print(text)
#
# ###################################################################################
# ###################################################################################
#
# # Вывод текста без преобразования специальных символов (для этого используется символ r)
# text = r"Message: \n\"Hello, World!\""
# print(text)
#
# ###################################################################################
# ###################################################################################
#
# # Использование встроенной функции type():
# userId = "abc"
# print(type(userId))
#
# userId = 123
# print(type(userId))
# ###################################################################################
# ###################################################################################
#
# # Арифметические операции с присвоением
# number = 10
# number += 5
# print(number)
#
# number -= 3
# print(number)
#
# number *= 4
# print(number)
#
# ###################################################################################
# ###################################################################################

# # Функция round() - округление резуьтата (если в функцию передается одно значение, то оно округлается до ближайшего целого):
# first_number = 2.0001
# second_number = 0.6
# third_number = first_number + second_number
# print(round(third_number))
# print(round(2.5554, 2))
# print(round(2.545, 2)) # Округление до четного числа
# print(round(2.578, 2))

###################################################################################
###################################################################################

'''
Упражнение 1
Напишите программу, которая вычисляет процент по банковскому вкладу.
Пусть для вычисления процентов по банковскому вкладу применяется формула (P * R * T) / 100,
где:
P – начальная сумма
R – процент по вкладу
T – количество лет
Пользователь вводит эти данные, а программа выводит ему ответ - сумму начисленных процентов.

Пример работы:
Начальная сумма вклада: 250000
Процент по вкладу: 36
Количество лет: 2
Начисленные проценты: 180000.0
'''

# p = float(input("Введите сумму вклада: "))
# r = float(input("Введите процент по вкладу: "))
# t = float(input("Введите количество лет: "))
#
# print(f"Начисленные проценты: {(p * r * t) / 100}")
###################################################################################
###################################################################################

'''
Упражнение 2
Напишите программу, в которой пользователь вводит температуру в градусах Цельсия, а программа переводит их в градусы Фаренге́йта. 
Для перевода применяется формула:
°F= (9/5)*(°C) + 32

Пример работы программы:
Введите температуру в градусах Цельсия: 19

19.0  градусов Цельсия равны  66.2  градусам Фаренгейта
'''
c = float(input("Введите температуру в градусах Цельсия: "))
print(f"{c} градусов Цельсия равны {round(((9/5)*c + 32), 2)} градусам Фаренгейта")

###################################################################################
###################################################################################

###################################################################################
###################################################################################

###################################################################################
###################################################################################

###################################################################################
###################################################################################
